<?php

use Illuminate\Support\Facades\Schema;
use Illuminate\Database\Schema\Blueprint;
use Illuminate\Database\Migrations\Migration;

class FixAreaHarbin240205 extends Migration
{

    public function beforeCmmUp()
    {
        //
    }

    public function beforeCmmDown()
    {
        //
    }

    /**
     * Run the migrations.
     *
     * @return void
     */
    public function up()
    {
        //
        $this->clear();
        $this->fixNew();
    }

    protected function clear(){
        $sql = <<<SQL
DELETE FROM qs_area where upid=230100;
SQL;

        \Illuminate\Support\Facades\DB::unprepared($sql);
    }

    protected function fixNew(){
        $sql = <<<SQL
INSERT INTO `qs_area` (`id`, `cname`, `cname1`, `upid`,  `ename`,  `pinyin`, `level`) VALUES 
('230102', '道里区', '', '230100', '', '', '3'), 
('230103', '南岗区', '', '230100', '', '', '3'), 
('230104', '道外区', '', '230100', '', '', '3'), 
('230108', '平房区', '', '230100', '', '', '3'), 
('230109', '松北区', '', '230100', '', '', '3'),
('230110', '香坊区', '', '230100', '', '', '3'), 
('230111', '呼兰区', '', '230100', '', '', '3'),
('230112', '阿城区', '', '230100', '', '', '3'),
('230113', '双城区', '', '230100', '', '', '3'),
('230123', '依兰县', '', '230100', '', '', '3'),
('230124', '方正县', '', '230100', '', '', '3'),
('230125', '宾县', '', '230100', '', '', '3'),
('230126', '巴彦县', '', '230100', '', '', '3'),
('230127', '木兰县', '', '230100', '', '', '3'),
('230128', '通河县', '', '230100', '', '', '3'), 
('230129', '延寿县', '', '230100', '', '', '3'), 
('230183', '尚志市', '', '230100', '', '', '3'),
('230184', '五常市', '', '230100', '', '', '3')
SQL;

        \Illuminate\Support\Facades\DB::unprepared($sql);
    }

    protected function fixOld(){
        $sql = <<<SQL
INSERT INTO `qs_area` (`id`, `cname`, `cname1`, `upid`, `ename`, `pinyin`, `level`) VALUES
('230102', '道里区', '', '230100', '', '', '3'),
('230103', '南岗区', '', '230100', '', '', '3'),
('230104', '道外区', '', '230100', '', '', '3'),
('230106', '香坊区', '', '230100', '', '', '3'),
('230107', '动力区', '', '230100', '', '', '3'),
('230108', '平房区', '', '230100', '', '', '3'),
('230109', '松北区', '', '230100', '', '', '3'),
('230111', '呼兰区', '', '230100', '', '', '3'),
('230123', '依兰县', '', '230100', '', '', '3'),
('230124', '方正县', '', '230100', '', '', '3'),
('230125', '宾县', '', '230100', '', '', '3'),
('230126', '巴彦县', '', '230100', '', '', '3'),
('230127', '木兰县', '', '230100', '', '', '3'),
('230128', '通河县', '', '230100', '', '', '3'),
('230129', '延寿县', '', '230100', '', '', '3'),
('230181', '阿城市', '', '230100', '', '', '3'),
('230182', '双城市', '', '230100', '', '', '3'),
('230183', '尚志市', '', '230100', '', '', '3'),
('230184', '五常市', '', '230100', '', '', '3'),
('230185', '阿城市', '', '230100', '', '', '3')
SQL;

        \Illuminate\Support\Facades\DB::unprepared($sql);
    }

    /**
     * Reverse the migrations.
     *
     * @return void
     */
    public function down()
    {
        //
        $this->clear();
        $this->fixOld();
    }

    public function afterCmmUp()
    {
        //
    }

    public function afterCmmDown()
    {
        //
    }
}
